const news = [
    {
        id: `1`,
        img: `1.jpg`,
        title: `Школьники примерили профессию бухгалтера`, 
        date: `31.10.2022`,
        desc: `27.10.2022 г. в ГАПОУ РБ «Политехнический техникум» прошла профессиональная проба по профессии «Бухгалтер».
        Проба направлена на выявление склонностей и способности учащихся к выполнению работ, связанных с обработкой цифровой информации и оформлением документации с использованием программы Ecxel, пробуждением интереса к экономике.
        В течение занятия все совместно создали портрет качеств, которыми должен обладать бухгалтер, узнали историю возникновения этой профессии.
        Побывав в роли бухгалтера, школьники, создавали таблицы - ведомости начисления заработной платы на разных листах электронной книги, произвели все необходимые расчеты, стоили гистограмму максимальной и минимальной заработной платы.        
        `
    },
    {
        id: `2`,
        img: `2.jpg`,
        title: `Профессиональные пробы по профессии "Электромонтер"`, 
        date: `25.10.2022`,
        desc: `Стартовал проект «Билет в будущее» в Политехническом техникуме».
        Уже на протяжении трех лет в октябре преподаватели техникума проводят профессиональные пробы для школьников Кабанского района. В этом году в проекте участвует Селенгинская школа №1.
        20 октября ученики 6 класса оценили свои возможности себя в роли электромонтера: ребята знакомились с инструментом электромонтера. Они соединяли провода с помощи скрутки и делали первые действия в пайке проводов. Следующим этапом будет подключение электроустановочных изделий.
        Всем ученикам были вручены сертификаты. Пробы на базе Политехнического техникума будут проходить до конца октября.
        `
    },
    {
        id: `3`,
        img: `3.jpg`,
        title: `Экспозиция, посвященная ко дню повара`,  
        date: `22.10.2022`,
        desc: `20 октября – один из самых замечательных праздников в мире. Ведь вкусно поесть любят все, а приготовить такую еду могут избранные. Международный день повара отмечают повара и кулинары, работники общепита и школьных столовых.
        Международный день повара, праздник хоть и молодой – в календаре дат и событий он появился в 2004 году – но уже очень популярный. Удивляться нечему: профессия, связанная с приготовлением еды, считается одной из самых важных. Ведь от того, что приготовят повара и кулинары, какие ингредиенты благодаря им окажутся в пище, зависит настроение и здоровье миллионов людей в мире.
        В библиотечном центре Политехнического техникума развернута экспозиция, посвященая этому профессиональному празднику.
        `
    },
    {
        id: `4`,
        img: `4.jpg`,
        title: `Экскурсия на производство`,  
        date: `21.10.2022`,
        desc: `19 октября студенты 1 курса специальности 13.02.07 «Электроснабжение» Политехнического техникума посетили базовое предприятие Селенгинский целлюлозно-картонный комбинат.
        В рамках изучения учебной дисциплины «Введение в специальность» специалисты комбината Залуцкий Иван Николаевич старший мастер по ремонту и обслуживанию электрооборудования ЭРЦ и Панина Татьяна Алексеевна, мастер цеха производства тарного картона и участка приготовления химикатов познакомили будущих электриков с производственным циклом предприятия, провели экскурсию по основным цехам комбината – электроцех и цех по производству картона.
        Особый интерес у первокурсников проявили к местам прохождения будущей производственной практики, на все вопросы студентов специалисты комбината дали исчерпывающие ответы.
        Первокурсники оценили масштаб производства Селенгинского ЦКК и с нетерпением ожидают начала производственной практики, на которой они полностью погрузятся в специальность.
        #политех03 #политехселенгинск #спо03
        `
    },
    {
        id: `5`,
        img: `5.jpg`,
        title: `Правовое колесо`,  
        date: `19.10.2022`,
        desc: `13 октября в Каменском филиале принимали гостей из Каменской библиотеки зав.библиотекой Жигалина Л.В и библиотекаря Штремель С.В. они провели для студентов 1, 2 и 3 курса мероприятие «Правовое колесо», где в игровой форме затронули темы:
        Знаешь ли ты право?
        Не попади в беду..
        провели практикумы: Следствие ведут знатоки., Школа юных сыщиков…
        Ребята разгадывали кроссворды, отвечали на вопросы правовой грамотности.
        Участие в интеллектуально- познавательном мероприятии «Правовое колесо» является серьезной предпосылкой для формирования компетенций, достаточных для защиты прав ,свобод и законных интересов личности, высокого уровня воспитанности, ответственности; активного вовлечения, заинтересованности молодежи в получении правовых знаний.
        Ребятам очень понравилось мероприятие, самые активные получили знак «Активный гражданин».
        #политех03 #политехселенгинск #спо03
        `
    },
    {
        id: `6`,
        img: `6.jpg`,
        title: `Сессия у студентов заочного отделения`,
        date: `19.10.2022`,
        desc: `Только во время сессии студент-заочник становится сверхчеловеком. Он перестаёт есть, спать и как суперкомпьютер способен загружать в себя нереальное количество информации.
        Именно такая пора наступила с 17 октября 2022г в Политехническом техникуме, а всё потому что началась сессия заочного отделения по специальности Дошкольное образование, отметим, что это первый набор заочников по этой специальности.
        15 девушек , будущих воспитателей приступили к обучению на срок 3 г 10 месяцев. Среднее профессиональное образование по этому профилю предполагает освоение гуманитарных, социально-экономических, математических и естественнонаучных предметов. Обучение заканчивается итоговой аттестацией в виде демонстрационного экзамена  и защитой диплома. Полученные теоретические знания закрепляются в ходе практики.  Во время обучения студент должен освоить технику общения, основы психодиагностики и методы коррекционной педагогики.
        Желаем удачной сессии!
        #спо03 #политех03 #политехселенгинск
        `
    },
]

const newsView = document.querySelector('.news__view')
const newsPagination = document.querySelector('.news__pagination')

// Пагинация
let newsOnPage = 3
let currentNote = 0
let paginationBtnCount = news.length / newsOnPage

for (var i = 0; i < paginationBtnCount; i++) {
    if (i === 0) {
        newsPagination.innerHTML += `
            <a class="news__pagination__item active">${i + 1}</a>
        ` 
    }
    else {
        newsPagination.innerHTML += `
            <a class="news__pagination__item">${i + 1}</a>
        `
    }
}

const paginationItems = document.querySelectorAll('.news__pagination__item')

news.forEach(newsItem => {
    if (currentNote < newsOnPage) {
        newsView.innerHTML += `
            <div class="news__item">
                <div class="news__item__cover">
                    <img src="img/news/${newsItem.img}" alt="${newsItem.id}" class="news__item__img">
                </div>
                <div class="news__item__content">
                    <h3 class="news__item__content__title">${newsItem.title}</h3>
                    <span class="news__item__content__date">${newsItem.date}</span>
                    <p class="news__item__content__desc">
                        ${newsItem.desc}
                    </p>
                    <a href="#" class="news__item__btn">
                        Подробнее
                    </a>
                </div>
            </div>
        `
    }
    currentNote++
})

paginationItems.forEach(item => {
    item.addEventListener('click', () => {
        

        let pageNum = item.innerHTML
        let startSlice = (pageNum - 1) * newsOnPage
        let endSlice = startSlice + newsOnPage
        let notes = news.slice(startSlice, endSlice)

        for (var i = 0; i < paginationItems.length; i++) {
            if (pageNum - 1 === i) {
                paginationItems[i].classList.add('active')
            }
            else {
                paginationItems[i].classList.remove('active')
            }
        }

        // console.log(notes)
        newsView.innerHTML = ``
        notes.forEach(note => {
            newsView.innerHTML += `
                <div class="news__item">
                    <div class="news__item__cover">
                        <img src="img/news/${note.img}" alt="${note.id}" class="news__item__img">
                    </div>
                    <div class="news__item__content">
                        <h3 class="news__item__content__title">${note.title}</h3>
                        <span class="news__item__content__date">${note.date}</span>
                        <p class="news__item__content__desc">
                            ${note.desc}
                        </p>
                        <a href="#" class="news__item__btn">
                            Подробнее
                        </a>
                    </div>
                </div>
            `
        })
    })
})